In [1]:
import pandas as pd

df = pd.DataFrame({
    'country' : ['india', 'US', 'japan', 'US' , 'japan'],
    'age' : [44, 34, 46, 35, 23],
    'salary' : [72000, 65000, 98000, 45000, 34000]
})
df

  country  age  salary
0   india   44   72000
1      US   34   65000
2   japan   46   98000
3      US   35   45000
4   japan   23   34000

In [8]:
from sklearn import preprocessing

le = preprocessing.LabelEncoder()
df['country'] = le.fit_transform(df['country'])
df

   country  age  salary
0        1   44   72000
1        0   34   65000
2        2   46   98000
3        0   35   45000
4        2   23   34000

In [9]:
label_encoder.classes_

array(['US', 'india', 'japan'], dtype=object)

In [10]:
a = df['country'].values.reshape(-1,1)
a

array([[1],
       [0],
       [2],
       [0],
       [2]], dtype=int64)

In [13]:
from sklearn import preprocessing

oe = preprocessing.OneHotEncoder()
a = oe.fit_transform(a).toarray()
a

array([[0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [1., 0., 0.],
       [0., 0., 1.]])

In [15]:
oe.categories_

[array([0, 1, 2], dtype=int64)]

In [17]:
df_oe = pd.DataFrame(a, columns = [str(i) for i in range(a.shape[1])])
df_oe

     0    1    2
0  0.0  1.0  0.0
1  1.0  0.0  0.0
2  0.0  0.0  1.0
3  1.0  0.0  0.0
4  0.0  0.0  1.0

In [18]:
df = pd.concat([df_oe, df], axis=1)
df

     0    1    2  country  age  salary
0  0.0  1.0  0.0        1   44   72000
1  1.0  0.0  0.0        0   34   65000
2  0.0  0.0  1.0        2   46   98000
3  1.0  0.0  0.0        0   35   45000
4  0.0  0.0  1.0        2   23   34000

In [19]:
df = df.drop(['country'], axis = 1)
df

     0    1    2  age  salary
0  0.0  1.0  0.0   44   72000
1  1.0  0.0  0.0   34   65000
2  0.0  0.0  1.0   46   98000
3  1.0  0.0  0.0   35   45000
4  0.0  0.0  1.0   23   34000